content/posts/dong2018.md
+++
title = "dong2018 | Dual-Quaternion-Based Spacecraft Autonomous Rendezvous and Docking Under Six-Degree-of-Freedom Motion Constraints"
author = ["João Gutemberg Farias"]
draft = false
+++

tag
: [Article - Dual Quaternions Applications]({{< relref "article_dual_quaternions_applications" >}})

The work shows the control of a [Rendezvous and Docking]({{< relref "rendezvous_and_docking" >}}) process using dual quaternions to describe the kinematics and formulate two restrictions, one for the line of sight of the chaser to the target spacecraft and other to ensure a safe approach path from the chaser to the target in order to not hit any external equipament of the target. The authors use Artificial Potential Functions to formulate the control problem and perform a [Lyapunov Stability Analysis]({{< relref "lyapunov_stability_analysis" >}}).


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

O trabalho mostra o controle do processo de Rendezvous e Docking usando quatérnios duais para formular duas restrições, uma que é manter a linha de vista entre o chaser e o target e a outra é garantir uma trajetória segura de aproximação, para não bater em nenhum componente do target. Os autores usam Artificial Potential Functions para formular o problema de controle e provam a estabilidade por Lyapunov.
